#### RDBMS- MySQL

## Necessary Modules

In [ ]:
#(** To avoid error ,first uninstall the modules if exists from before. Then install again.)
#pip3 install mysql-connector-python
# pip3 install mysqlclient
# pip3 install ipython-sql
# pip3 install mypy-extensions
# pip3 install SQLAlchemy
# pip3 install PyMySQL

## Creating a database and connecting to it

In [1]:
#Connecting to MySQL database
import mysql.connector as sql
mydb=sql.connect(host="localhost",user="root",passwd="Mahmud")
mycursor = mydb.cursor()

In [ ]:
#Creating a database
mycursor.execute("CREATE DATABASE Problem_set_05")

In [ ]:
#Deleting the database
# mycursor.execute("DROP DATABASE Problem_set_05")

In [2]:
%load_ext sql

In [3]:
#Connecting to the database which was created before
%sql mysql://root:Mahmud@localhost/Problem_set_05

## Schema

![Cat](dataset/schema.png)

Note: **CITY.CountryCode** and **COUNTRY.Code** are matching key columns.

## Creating necessary table

In [ ]:
%%sql
create table CITY(ID INTEGER,
                  NAME VARCHAR(40),
                  COUNTRYCODE VARCHAR(3),
                  DISTRICT VARCHAR(40),
                  POPULATION INTEGER
                    )

In [ ]:
%%sql
desc CITY

In [ ]:
# %%sql
# drop table CITY;

In [ ]:
%%sql
create table COUNTRY(CODE VARCHAR(3),
                     NAME VARCHAR(50),
                     CONTINENT VARCHAR(15),
                     REGION VARCHAR(30),
                     SURFACEAREA INTEGER,
                     INDEPYEAR VARCHAR(5),
                     POPULATION INTEGER,
                     LIFEEXPECTANCY VARCHAR(5),
                     GNP INTEGER,
                     GNPOLD VARCHAR(10),
                     LOCALNAME VARCHAR(50),
                     GOVERNMENTFORM VARCHAR(50),
                     HEADOFSTATE VARCHAR(40),
                     CAPITAL VARCHAR(5),
                     CODE2 VARCHAR(2)
                      )

In [ ]:
%%sql
desc COUNTRY

In [ ]:
# %%sql
# drop table COUNTRY;

## Loading data to the table

In [ ]:
%%sql
load data infile "C:/ProgramData/MySQL/MySQL Server 8.0/Uploads/p5_city.csv"
  into table CITY
    fields terminated by ","
      enclosed by '"'
        lines terminated by '\n'
          ignore 1 rows;

In [ ]:
%%sql
load data infile "C:/ProgramData/MySQL/MySQL Server 8.0/Uploads/p5_country.csv"
  into table COUNTRY
    fields terminated by ","
      enclosed by '"'
        lines terminated by '\n'
          ignore 1 rows;

In [4]:
%%sql
SELECT * FROM CITY LIMIT 5;

 * mysql://root:***@localhost/Problem_set_05
5 rows affected.

[(4, 'Mazar-e-Sharif', 'AFG', 'Balkh', 127800),
 (11, 'Groningen', 'NLD', 'Groningen', 172701),
 (80, 'Merlo', 'ARG', 'Buenos Aires', 463846),
 (89, 'San Isidro', 'ARG', 'Buenos Aires', 306341),
 (91, 'Malvinas Argentinas', 'ARG', 'Buenos Aires', 290335)]

In [5]:
%%sql
SELECT * FROM COUNTRY LIMIT 5;

 * mysql://root:***@localhost/Problem_set_05
5 rows affected.

[('ABW', 'Aruba', 'North America', 'Caribbean', 193, None, 103000, '78.4', 828, '793', 'Aruba', 'Nonmetropolitan Territory of The Netherlands', 'Beatrix', '129', 'AW'),
 ('AFG', 'Afghanistan', 'Asia', 'Southern and Central Asia', 652090, '1919', 22720000, '45.9', 5976, None, 'Afganistan/Afqanestan', 'Islamic Emirate', 'Mohammad Omar', '1', 'AF'),
 ('AIA', 'Anguilla', 'North America', 'Caribbean', 96, None, 8000, '76.1', 63, None, 'Anguilla', 'Dependent Territory of the UK', 'Elisabeth II', '62', 'AI'),
 ('AND', 'Andorra', 'Europe', 'Southern Europe', 468, '1278', 78000, '83.5', 1630, None, 'Andorra', 'Parliamentary Coprincipality', None, '55', 'AD'),
 ('ANT', 'Netherlands Antilles', 'North America', 'Caribbean', 800, None, 217000, '74.7', 1941, None, 'Nederlandse Antillen', 'Nonmetropolitan Territory of The Netherlands', 'Beatrix', '33', 'AN')]

### Problem 1: Given the CITY and COUNTRY tables, query the sum of the populations of all cities where the CONTINENT is 'Asia'.

In [6]:
%%sql
select sum(CITY.POPULATION) as "Population"
  from CITY inner join COUNTRY
    on CITY.COUNTRYCODE=COUNTRY.CODE
      where CONTINENT="Asia";

 * mysql://root:***@localhost/Problem_set_05
1 rows affected.

[(Decimal('27028484'),)]

### Problem 2: Given the CITY and COUNTRY tables, query the names of all cities where the CONTINENT is 'Africa'.

In [7]:
%%sql
select CITY.NAME 
  from CITY inner join COUNTRY
    on CITY.COUNTRYCODE=COUNTRY.CODE
      where CONTINENT="Africa"

 * mysql://root:***@localhost/Problem_set_05
8 rows affected.

[('Qina',),
 ('Warraq al-Arab',),
 ('Kempton Park',),
 ('Alberton',),
 ('Klerksdorp',),
 ('Uitenhage',),
 ('Brakpan',),
 ('Libreville',)]

### Problem 3:	Given the CITY and COUNTRY tables, query the names of all the continents (COUNTRY.Continent) and their respective average city populations (CITY.Population) rounded down to the nearest integer.

In [8]:
%%sql
select COUNTRY.CONTINENT,round(avg(CITY.POPULATION)) as "Average Population"
  from CITY inner join COUNTRY
    on CITY.COUNTRYCODE=COUNTRY.CODE
      group by 1

 * mysql://root:***@localhost/Problem_set_05
5 rows affected.

[('Asia', Decimal('693038')),
 ('Oceania', Decimal('109190')),
 ('Europe', Decimal('175138')),
 ('South America', Decimal('147435')),
 ('Africa', Decimal('274439'))]

### Problem 4:	Query the NAME, POPULATION and GNP of the country where GNP is maximum.

In [9]:
%%sql
select NAME,POPULATION,GNP 
  from COUNTRY
    where GNP=(select max(GNP) from COUNTRY)

 * mysql://root:***@localhost/Problem_set_05
1 rows affected.

[('United States', 278357000, 8510700)]

### Problem 5:	Query the NAME, POPULATION and GNP of the country where GNP is minimum.

In [10]:
%%sql
select NAME,POPULATION,GNP 
  from COUNTRY
    where GNP=(select min(GNP) from COUNTRY)

 * mysql://root:***@localhost/Problem_set_05
18 rows affected.

[('Cocos (Keeling) Islands', 600, 0),
 ('Christmas Island', 2500, 0),
 ('Falkland Islands', 2000, 0),
 ('Heard Island and McDonald Islands', 0, 0),
 ('British Indian Ocean Territory', 0, 0),
 ('Northern Mariana Islands', 78000, 0),
 ('Mayotte', 149000, 0),
 ('Norfolk Island', 2000, 0),
 ('Niue', 2000, 0),
 ('Pitcairn', 50, 0),
 ('South Georgia and the South Sandwich Islands', 0, 0),
 ('Saint Helena', 6000, 0),
 ('Svalbard and Jan Mayen', 3200, 0),
 ('Saint Pierre and Miquelon', 7000, 0),
 ('Tokelau', 2000, 0),
 ('United States Minor Outlying Islands', 0, 0),
 ('Virgin Islands, U.S.', 93000, 0),
 ('Wallis and Futuna', 15000, 0)]

### Problem 6:	Query the NAME of the country having most LIFEEXPECTANCY.

In [11]:
%%sql
select NAME,LIFEEXPECTANCY
  from COUNTRY
    order by 2 desc
      limit 1

 * mysql://root:***@localhost/Problem_set_05
1 rows affected.

[('Andorra', '83.5')]

### Problem 7:	Query the NAME and GNP of the largest COUNTRY.

In [12]:
%%sql
select NAME,GNP from COUNTRY
  where SURFACEAREA=(select max(SURFACEAREA) from COUNTRY)
    
-- METHOD 1

 * mysql://root:***@localhost/Problem_set_05
1 rows affected.

[('Russian Federation', 276608)]

In [13]:
%%sql
select NAME,GNP from COUNTRY
  order by SURFACEAREA desc 
    limit 1
    
-- METHOD 2

 * mysql://root:***@localhost/Problem_set_05
1 rows affected.

[('Russian Federation', 276608)]

### Problem 8:	Query the NAME and GNP of the most populated COUNTRY.

In [14]:
%%sql  
select NAME,GNP from COUNTRY   
  where POPULATION=(select max(POPULATION) from COUNTRY)

-- METHOD 1

 * mysql://root:***@localhost/Problem_set_05
1 rows affected.

[('India', 447114)]

In [15]:
%%sql
select NAME,GNP from COUNTRY
  order by POPULATION desc 
    limit 1
    
-- METHOD 2

 * mysql://root:***@localhost/Problem_set_05
1 rows affected.

[('India', 447114)]